{
    "name": "Disclosure",
    "introcontent": [
        {
            "title": "Introduction",
            "components": [
                {
                    "subtitle": "",
                    "type": "text-paragraph",
                    "text": "This section will introduce the concept of disclosure and guidelines for supporting a student who chooses to disclose a disability at the University. It will also make clear your responsibilities as a member of Staff/Placement team.",
                    "space_after": "false"
                }
            ],
            "space_after": "true"
        },
        {
            "title": "Learning Outcomes",
            "components": [
                {
                    "subtitle": "",
                    "type": "list-text",
                    "list_elements": [
                        {
                            "text": "To provide a clear definition of the concept of disclosure."
                        },
                        {
                            "text": "To provide staff with adequate guidelines about how to support students who choose to disclose a disability."
                        },
                        {
                            "text": "To ensure staff are able to provide students with adequate information and support when the make a disclosure."
                        }
                    ],
                    "space_after": "false"
                }
            ],
            "space_after": "false"
        }
    ],
    "chapters": [
        {
            "blockname": "Disclosure",
            "name": "Definition",
            "sections": [
                {
                    "subtitle": "What is Disclosure",
                    "space_after": true,
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "Disclosure is making known a disability to the university.  It involves discussing difficulties the student may encounter, any reasonable adjustments needed for attainment and individual examination arrangements."
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Disclosure",
            "name": "Procedure",
            "sections": [
                {
                    "subtitle": "Student Disclosure",
                    "components": [
                        {
                            "subtitle": "How to check if a student’s disclosure has been verified?",
                            "type": "text-paragraph",
                            "text": "You can check if a student’s disability has been verified by logging into Universe. Highlight the student’s name, processes, student details, disability details, processes, edit details. If verified, the disability record status will say ‘verified by office’.  If unsure, please use e-mail below:",
                            "space_after": false
                        },
                        {
                            "space_after": true,
                            "type": "link-email",
                            "links": [
                                {
                                    "link": "disabilityadvisor.ss@coventry.ac.uk",
                                    "text": "disabilityadvisor.ss@coventry.ac.uk"
                                }
                            ]
                        },
                        {
                            "subtitle": "2.2\tWhat to do if a student comes to you to disclose",
                            "space_after": false,
                            "type": "text-paragraph",
                            "text": "If a student discloses a disability to you, please advise them to make an appointment with a Disability Advisor. The disability advisor will discuss with them the information they need to provide, discuss support and other options available. Appointments can be made through the student portal and selecting ‘support at CU’. If unsure, the disability advisors can be contacted through emailing:"
                        },
                        {
                            "space_after": true,
                            "type": "link-email",
                            "links": [
                                {
                                    "link": "disabilityadvisor.ss@coventry.ac.uk",
                                    "text": "disabilityadvisor.ss@coventry.ac.uk"
                                }
                            ]
                        }
                    ],
                    "space_after": false
                }
            ]
        },
        {
            "blockname": "Disclosure",
            "name": "Benefits",
            "sections": [
                {
                    "subtitle": "Benefits to student disclosing",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "A student who has disclosed a disability, and had their disability verified, can receive various support from the disabilities team and their Learning Support Tutor (LST). Support from the disabilities team includes specialist tuition for study skills e.g. structuring paragraphs and reflective writing skills.",
                            "space_after": true
                        },
                        {
                            "space_after": false,
                            "type": "text-paragraph",
                            "text": "They may also be advised to apply for Disabled Student Allowance (DSA) which can include funding towards specialist equipment."
                        },
                        {
                            "type": "text-paragraph",
                            "space_after": false,
                            "text": "Where staff know about difficulties experienced, they can then make adjustments. However, some students may not want to disclose; it is their choice."
                        }
                    ],
                    "space_after": true
                }
            ]
        }
    ]
}