{
    "block": "Educators",
    "name": "Ready for Placement",
    "chapters": [
        {
            "blockname": "Educators",
            "name": "Introduction",
            "sections": [
                {
                    "subtitle": "Introduction",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "Are you ready to have a student? The student will be coming to your organisation possibly for the first time and first impressions matter; they may set the tone for the entire placement. Students who feel welcome and sense that their educator is ready to support their learning typically have high rates of satisfaction and are more likely to have a successful placement."
                        }
                    ]
                },
                {
                    "subtitle": "Learning Outcomes",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "This section will provide some suggestions on what you could do to prepare for a student coming on placement."
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Ready for Placement",
            "name": "Final Preparations",
            "sections": [
                {
                    "subtitle": "Checklist",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "You should be aware of the students who will be coming on placement. \n\nSome students may contact the placement and may need to arrange a pre-placement visit. Some students may need to discuss Reasonable Adjustments. If you have any questions about students or how to respond to their needs, contact the University placement team for support."
                        },
                        {
                            "type": "text-paragraph",
                            "text": "You do not have to commit a lot of time to preparing for a placement. The University would have provided some information on training days and materials are available for educators on Placement Connect",
                            "links": [
                                {
                                    "portion": "http://placementconnect.coventry.ac.uk/",
                                    "href": "http://placementconnect.coventry.ac.uk/"
                                }
                            ]
                        },
                        {
                            "type": "link-website",
                            "links": [
                                {
                                    "link": "http://placementconnect.coventry.ac.uk/",
                                    "text": "http://placementconnect.coventry.ac.uk/"
                                }
                            ]
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "You know the student(s) you will be having on placement"
                                },
                                {
                                    "text": "You have an induction plan for the students"
                                },
                                {
                                    "text": "You are able to speak a student if they make pre-placement contact to introduce themselves or discuss concerns or reasonable adjustments."
                                },
                                {
                                    "text": "You have supervision and support while the student is on placement."
                                },
                                {
                                    "text": "You have all the information you need"
                                }
                            ]
                        },
                        {
                            "subtitle": "Template",
                            "type": "link-pdf",
                            "links": [
                                {
                                    "link": "pdfs/Provider Health and Safety Letter Template.docx",
                                    "text": "Provider Health and Safety Letter Template (Download)"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Ready for Placement",
            "name": "Am I ready for the student",
            "sections": [
                {
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "Burns and Paterson 2004 found that the top three elements for a successful placement are: adequate mentor support, developing and monitoring the clinical learning environment and increased collaboration between the HEI and service providers in the allocation of students to appropriate practice placement areas."
                        },
                        {
                            "subtitle": "Reference",
                            "type": "link-pdf",
                            "links": [
                                {
                                    "link": "pdfs/Clinical practice and placement support supporting learning in parctice Burns and Paterson.pdf",
                                    "text": "Clinical practice and placement support supporting learning in parctice Burns and Paterson"
                                }
                            ]
                        },
                        {
                            "type": "video-single",
                            "subtitle": "Clinical Nurse Educator",
                            "video": {
                                "type": "youtube",
                                "src": "https://www.youtube.com/embed/XdiJGxPeIB4",
                                "thumb": "XdiJGxPeIB4.jpg"
                            }
                        }
                    ],
                    "subtitle": "Are you ready?"
                },
                {
                    "subtitle": "Welcoming a student",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "How can a placement site or educator/mentor make a student feel welcome? \n\nIt is important feel like the placement is genuinely ready and happy to have them. They have proper induction and staff are friendly and supportive."
                        },
                        {
                            "type": "link-pdf",
                            "links": [
                                {
                                    "link": "pdfs/Sandwich_Placement_Induction_Areas.docx",
                                    "text": "Sandwich Placement Induction Areas (Download)"
                                }
                            ]
                        },
                        {
                            "subtitle": "Setting placement goals",
                            "type": "text-paragraph",
                            "text": "Encourage the student to think about what they want to achieve. Students are advised to start a placement by thinking about what they want to achieve and how they could best achieve that. Some students will share their strengths with you and may be happy to discuss particular areas they want to develop. \n\nIt is important to make the goals explicit, so you both know what you are working towards and how you can assess the success of the placement. Things may not go exactly as planned but having a plan helps to focus your energies. \n\nStudents will also benefit if you tell them how you will be giving them feedback and how you expect from them."
                        },
                        {
                            "type": "video-single",
                            "subtitle": "Clinical Nurse Educator",
                            "video": {
                                "type": "youtube",
                                "src": "https://www.youtube.com/embed/iQAsUKBBnSM",
                                "thumb": "iQAsUKBBnSM.jpg"
                            }
                        },
                        {
                            "subtitle": "Professionalism",
                            "type": "text-paragraph",
                            "text": "Students are valued on placement because they can contribute to patient care and service delivery.\n\nStudents who feel that they are part of the team and valued are more likely to have a good experience and successful placement (Paterson, 1997).\n\nCommunicate with students professionally and be clear they understand how to be a professional."
                        },
                        {
                            "type": "video-single",
                            "subtitle": "Clinical Nurse Educator",
                            "video": {
                                "type": "youtube",
                                "src": "https://www.youtube.com/embed/Pcn93Yux06s",
                                "thumb": "Pcn93Yux06s.jpg"
                            }
                        },
                        {
                            "subtitle": "Support for educator or mentor",
                            "type": "text-paragraph",
                            "text": "It is important that educators and mentors take care of themselves. When working with students, particularly if you are supporting a students who is struggling, seek help from your colleagues and line managers. Collaboration and collegiality can help you stay objective and professional. Colleagues may also be able to provide innovative methods of supporting the student."
                        },
                        {
                            "subtitle": "A pre-placement visit or call could include the following",
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "An introductory, informal chat"
                                },
                                {
                                    "text": "Outline vision and values, policies and procedures"
                                },
                                {
                                    "text": "Report writing processes"
                                },
                                {
                                    "text": "Tour of the building"
                                },
                                {
                                    "text": "Introduction to colleagues and people the student will be working with"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Ready for Placement",
            "name": "Summary",
            "sections": [
                {
                    "subtitle": "Summary",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "This section helps you think about how prepared you are for a student coming on placement."
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Ready for Placement",
            "name": "References",
            "sections": [
                {
                    "subtitle": "References",
                    "components": [
                        {
                            "type": "link-pdf",
                            "links": [
                                {
                                    "link": "pdfs/Guidelines for Academics Supervising Sandwich Placement Students_Sept 2017.docx",
                                    "text": "Guidelines for Academics Supervising Sandwich Placement Students"
                                }
                            ]
                        },
                        {
                            "type": "link-website",
                            "links": [
                                {
                                    "link": "http://placementconnect.coventry.ac.uk/",
                                    "text": "Placement connect"
                                }
                            ]
                        },
                        {
                            "type": "link-reference",
                            "link": "http://journals.sagepub.com/doi/abs/10.1177/153944929701700103",
                            "authors": [
                                {
                                    "name": "Patterson ML"
                                }
                            ],
                            "year": "1997",
                            "publisher": "Research Article",
                            "pages": "48-54",
                            "title": "Clinician Productivity with and without Students. OTJR: Occupation, Participation and Health."
                        }
                    ]
                }
            ]
        }
    ]
}