{
    "block": "Students",
    "name": "Disclosure",
    "chapters": [
        {
            "blockname": "Disclosure",
            "name": "Introduction",
            "sections": [
                {
                    "subtitle": "Introduction",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "This section will introduce the concept of disclosure and guidelines for disclosing a disability at the University.",
                            "space_after": false
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "Learning Outcomes",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "To provide a clear definition of the concept of disclosure."
                                },
                                {
                                    "text": "To provide students with adequate guidelines and practical tips about how to disclose a disability."
                                },
                                {
                                    "text": "To provide students with a step-by-step guide of how disclosure is evidenced and recorded at the University."
                                },
                                {
                                    "text": "To support students understand their rights and responsibilities with respect to disclosure."
                                }
                            ],
                            "space_after": false
                        }
                    ],
                    "space_after": false
                }
            ]
        },
        {
            "blockname": "Disclosure",
            "name": "Definition",
            "sections": [
                {
                    "subtitle": "What is Disclosure?",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "Disclosure is making a disability known to the university.  It involves discussing difficulties you may encounter, any reasonable adjustments needed for attainment and individual examination arrangements.",
                            "space_after": true
                        },
                        {
                            "subtitle": "",
                            "type": "text-mythfact",
                            "myths": [
                                {
                                    "myth": "A job applicant has to tell an employer if they are disabled.",
                                    "fact": "No. A disabled person can keep a disability confidential."
                                }
                            ],
                            "space_after": false
                        }
                    ],
                    "space_after": false
                }
            ]
        },
        {
            "blockname": "Disability",
            "name": "Disclosing your disability to employers",
            "sections": [
                {
                    "subtitle": "Deciding whether to disclose your disability",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "Deciding to disclose your disability to an employer is a matter of personal choice. You are under no legal obligation to do so, and it’s for you to choose if and when you disclose.  It is advisable to disclose, because once you’ve told an employer about your disability, you’re protected by the Equality Act 2010. This act protects individuals with Protected Characteristics from discrimination in the workplace. There are 9 Protected characteristics including disabilities (and long term health conditions such as a mental health condition), that may have substantial and long-term adverse effect on a person’s ability to carry out normal day-to-day activities",
                            "links": [
                                {
                                    "portion": "Equality Act 2010",
                                    "href": "content/students/blocks/Learning-in-Practice/chapter/The-Equality-Act"
                                }
                            ]
                        },
                        {
                            "type": "text-paragraph",
                            "text": "Think about whether your disability raises a health and safety issue for yourself or your future colleagues. If it does, you may have to disclose so that employers can help ensure you have a safe working environment. You may also wish to disclose if you need any adjustments to help accommodate your disability, either at the application stage or during your day-to-day work."
                        },
                        {
                            "type": "text-paragraph",
                            "text": "Once you’ve told an employer about your disability, you’re protected by the Equality Act 2010. This means your employer must take all reasonable steps to provide the necessary adjustments and mustn’t discriminate against you because of your disability.",
                            "links": [
                                {
                                    "portion": "Equality Act 2010",
                                    "href": "content/students/blocks/Learning-in-Practice/chapter/The-Equality-Act"
                                }
                            ]
                        },
                        {
                            "type": "text-paragraph",
                            "text": "Bear in mind that if you choose not to tell your employer and later underperform, you won’t be covered by the Equality Act. An employer who was unaware of your condition can’t be judged to have discriminated against you.",
                            "links": [
                                {
                                    "portion": "Equality Act",
                                    "href": "content/students/blocks/Learning-in-Practice/chapter/The-Equality-Act"
                                }
                            ]
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "When to disclose your disability",
                    "components": [
                        {
                            "type": "list-text",
                            "subtitle": "Application stage",
                            "list_elements": [
                                {
                                    "text": "There may be a section on the application form asking about any serious health conditions or disabilities. Although you don’t generally have to disclose your disability here, you mustn’t lie. If you don’t want to disclose, simply don’t answer the question. You can also use the personal statement section of the form to tell an employer about your disability."
                                }
                            ]
                        },
                        {
                            "type": "list-text",
                            "subtitle": "CV",
                            "list_elements": [
                                {
                                    "text": "There may be a gap in your educational history due to a period of prolonged illness. You can use your covering letter to explain this, but always present it in a way that will show you in a positive light. You can also refer to your disability in your CV if you attended a specialist school or college for disabled people."
                                }
                            ]
                        },
                        {
                            "type": "list-text",
                            "subtitle": "Covering letter",
                            "list_elements": [
                                {
                                    "text": "If you mention your disability here, emphasise how it has further developed the skills and experience mentioned in your CV. However, only raise this when it’s relevant to your application. For example, point to how well you’ve achieved your goals despite any difficulties."
                                }
                            ]
                        },
                        {
                            "type": "list-text",
                            "subtitle": "Pre-interview stage",
                            "list_elements": [
                                {
                                    "text": "This is when you may want to identify practical needs so you can compete equally with other applicants. If you haven’t been asked about your needs, take the initiative and contact the employer in advance – they may need time to make arrangements."
                                }
                            ]
                        },
                        {
                            "type": "list-text",
                            "subtitle": "Interview",
                            "list_elements": [
                                {
                                    "text": "You may feel more comfortable disclosing when you can discuss the implications face-to-face and more clearly demonstrate your skills. If you’ve previously mentioned your disability, the interview can be an opportunity to expand on any positive effects it’s had on your life and how it’s enhanced your employability."
                                }
                            ]
                        },
                        {
                            "type": "list-text",
                            "subtitle": "In the job",
                            "list_elements": [
                                {
                                    "text": "You may decide to disclose your disability once you’ve been offered the job or when you start work. You can decide who to tell – your manager or HR – and you can also request that colleagues aren’t told. If your condition affects the way you work, it may be helpful to be open with colleagues so they understand and can help you with anything you may need."
                                }
                            ]
                        }
                    ]
                },
                {
                    "subtitle": "How to disclose your disability",
                    "components": [
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Only discuss your disability in terms of its relevance to your performance in the job. Don’t go into personal detail. Always be positive about your disability and use it to provide evidence of the skills employers look for."
                                },
                                {
                                    "text": "Emphasise positive achievements and give examples. You may have gained skills such as flexibility, determination, the ability to perform under pressure and creative problem-solving as a result of your disability, and you shouldn’t be afraid to use these as selling points."
                                },
                                {
                                    "text": "Make a positive statement about your disability to remove any doubts an employer may have. Don’t assume they’ll have a negative attitude – your experiences and skills may give you the edge over other candidates."
                                },
                                {
                                    "text": "Avoid focusing the whole of your application or interview on the issue of your disability. Your main focus should be on showing the employer your suitability for the job. Speak to a careers adviser about whether, when and how to tell an employer about your disability."
                                },
                                {
                                    "text": "Some interviewers have little experience of disability and may feel unsure of workplace implications. Be prepared to make suggestions about what adjustments you would need in order to do the job effectively"
                                }
                            ]
                        }
                    ]
                },
                {
                    "subtitle": "For support with disclosing your disability",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "Employability Support can advise students on how and when to make a disclosure. We can help student to present information to employers in a positive, responsible and professional manner.  Employability Support also works with employers to help them to make adjustments and prepare to take a student with disability on placement. For further information contact Employability Support."
                        },
                        {
                            "type": "link-telephone",
                            "text": "+44 (0) 24 7765 2011",
                            "subtitle": "Careers and Employability Services"
                        },
                        {
                            "type": "link-email",
                            "links": [
                                {
                                    "link": "careers.ss@coventry.ac.uk",
                                    "text": "careers.ss@coventry.ac.uk"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Disclosure",
            "name": "Procedure",
            "sections": [
                {
                    "subtitle": "How do you disclose?",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "You can disclose at any time during the recruitment process, such as on your application or UCAS form, or when you are on your course. ",
                            "space_after": false
                        },
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "You can also disclose a disability through contacting the Disabilities Team using Connect2 or emailing: ",
                            "space_after": false
                        },
                        {
                            "subtitle": "E-mail Contact Address",
                            "type": "link-email",
                            "links": [
                                {
                                    "text": "disabilityadvisor.ss@coventry.ac.uk",
                                    "link": "mailto:disabilityadvisor.ss@coventry.ac.uk"
                                }
                            ],
                            "space_after": false
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "Contact Disability Office",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "An appointment with a Disability Advisor can be made by following the link: ",
                            "space_after": false
                        },
                        {
                            "subtitle": "",
                            "type": "link-website",
                            "text": "https://healthandwellbeingbookings.coventry.ac.uk/",
                            "links": [
                                {
                                    "tag": "",
                                    "text": "Health and Wellbeing Bookings (CU)",
                                    "link": "https://healthandwellbeingbookings.coventry.ac.uk/"
                                }
                            ],
                            "space_after": false
                        },
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "You can also make appointments or contact the Disabilities Team through the student portal and selecting ‘support at CU’.",
                            "space_after": false
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "Documentation",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "Documents that will need to be provided and completed are:",
                            "space_after": false
                        },
                        {
                            "subtitle": "",
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Evidence of your disability"
                                },
                                {
                                    "text": "Completion of Individual Examination Arrangement (IEA) form for courses with exams"
                                }
                            ],
                            "space_after": false
                        },
                        {
                            "subtitle": "Links to Forms",
                            "type": "link-website",
                            "links": [
                                {
                                    "tag": "",
                                    "text": "Sheltered Conditions Form",
                                    "link": "https://share.coventry.ac.uk/students/Disabilities/Lists/Sheltered%20Conditions%20Form/NewForm.aspx?&Source=https%3a//share.coventry.ac.uk/students/Disabilities/Pages/ThankYouSF.aspx"
                                }
                            ],
                            "space_after": false
                        },
                        {
                            "subtitle": "Link to Document",
                            "type": "link-pdf",
                            "text": "Document",
                            "link": "",
                            "space_after": false
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "What counts as evidence",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "Evidence of a disability is either medical evidence or a diagnostic report. If you have a specific learning difficulty (SpLD), such as dyslexia, you will need to provide a copy of your diagnostic report.",
                            "space_after": false
                        },
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "If you have a medical condition, you will need to provide evidence of your condition. This may be a doctor’s letter, copy of medical records or a medical report. The evidence should outline how your disability impacts upon your daily activities.",
                            "space_after": false
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "Medical Evidence",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "If you have a medical condition, you will need to provide evidence including a doctor’s letter, copy of medical records or a medical report. If you have an autism spectrum condition, you will need to provide a copy of an educational psychologist's report or doctors letter. ",
                            "space_after": false
                        },
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "All evidence should outline how your disability impacts upon your daily activities.",
                            "space_after": false
                        }
                    ],
                    "space_after": true
                }
            ]
        },
        {
            "blockname": "Disclosure",
            "name": "Verifying",
            "sections": [
                {
                    "subtitle": "How to Verify Evidence",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "Provide your evidence to the Disabilities Team, either by email or by visiting the Disabilities Team on the 2nd floor of the Hub. Once you have provided your diagnostic evidence, the disabilities department will verify your disability on Universe. ",
                            "space_after": false
                        }
                    ],
                    "space_after": false
                },
                {
                    "subtitle": "Contact Details",
                    "components": [
                        {
                            "subtitle": "Telephone",
                            "type": "link-telephone",
                            "text": "+44 (0)24 7765 8029",
                            "space_after": false
                        },
                        {
                            "subtitle": "E-mails",
                            "type": "link-email",
                            "links": [
                                {
                                    "tag": "Disability Team",
                                    "text": "disabilityadvisor.ss@coventry.ac.uk",
                                    "link": "mailto:disabilityadvisor.ss@coventry.ac.uk"
                                },
                                {
                                    "tag": "Mental health and counselling",
                                    "text": "counsell.ss@coventry.ac.uk",
                                    "link": "mailto:counsell.ss@coventry.ac.uk"
                                }
                            ],
                            "space_after": false
                        }
                    ],
                    "space_after": false
                }
            ]
        },
        {
            "blockname": "Disclosure",
            "name": "Sign Data Protection",
            "sections": [
                {
                    "subtitle": "How to sign the Data Protection Form",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "The data protection form should be signed as soon as possible once you have made contact with the Disabilities Team. It can be completed electronically (by emailing and scanning your copy), during an appointment or you can visit the department. These forms allow staff to communicate with other members of staff to organise adjustments, exam arrangements, funding (where applicable) and care for other needs if needed. ",
                            "space_after": false
                        },
                        {
                            "subtitle": "Without your signature we cannot take action!",
                            "type": "text-alert",
                            "text": "These forms allow staff to communicate with other members of staff to organise adjustments, exam arrangements, funding (where applicable) and care for other needs if needed.",
                            "space_after": false
                        }
                    ],
                    "space_after": false
                }
            ]
        },
        {
            "blockname": "Disclosure",
            "name": "Department Awareness",
            "sections": [
                {
                    "subtitle": "Make your department aware of your disability",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "You should tell your department directly about your disability, which can be done through email or \"face-to-face\" conversations. Your department can also look on Solar which contains information about disability details, exam arrangements and reasonable adjustments.",
                            "space_after": false
                        }
                    ],
                    "space_after": false
                }
            ]
        },
        {
            "blockname": "Disclosure",
            "name": "Confidentiality",
            "sections": [
                {
                    "subtitle": "Confidentiality",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "The University has a legal obligation to support to keep all sensitive information about students’ confidential adhering to data protection laws. When a student provides information about a disability, condition, or other medical needs it will be treated with strict confidentiality. The University has policies in place to ensure data is protected reasonably and confidentiality maintained. \nThe Disability Team will hold all data students provide about their disability and you can decide who you need to share this information with. To discuss reasonable adjustments on placements, you will need share the information with teams and people on a “need to know” bases for example - the placement team, the learning support tutor and the placement teams. You are not obliged to share the information. If you share the information, you will be supported by the various support teams and you will sign a disability disclosure agreement."
                        }
                    ]
                },
                {
                    "subtitle": "How information submitted to the Disability Team is stored",
                    "components": [
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Information held by the Disability Team about students will be held for 6 years in accordance with the Data Protection Act (1998). It is then disposed of securely."
                                },
                                {
                                    "text": "All written records and files containing students' confidential details will be kept in a secure and locked environment. Student details are kept electronically on the secure databases. The records are accessible to authorised University staff. Under the Data Protection Act (1998) students have the right to access their own records."
                                },
                                {
                                    "text": "Statistical information gathered for research, evaluation or monitoring purposes will be anonymous."
                                }
                            ]
                        }
                    ]
                },
                {
                    "subtitle": "Speaking to your personal tutor and LST",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "All Faculties and Departments have an allocated Learning Support Tutor. Contact your learning Support tutor for information and support about preparing for placements and any challenges you may have."
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Disclosure",
            "name": "Quiz",
            "sections": [
                {
                    "subtitle": "Quiz on Disclosure",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "quiz",
                            "questions": [
                                {
                                    "index": 0,
                                    "text": "Disclosure involves taking responsibility to make your disability known to the university through completing the admissions form or by discussing your disability with the Disabilities Team.",
                                    "answers": [
                                        {
                                            "id": 0,
                                            "text": "True"
                                        },
                                        {
                                            "id": 1,
                                            "text": "False"
                                        }
                                    ],
                                    "correct_answer": 0,
                                    "tip": ""
                                },
                                {
                                    "index": 1,
                                    "text": "The university can verify your disability when you talk to them about your needs.",
                                    "answers": [
                                        {
                                            "id": 0,
                                            "text": "True"
                                        },
                                        {
                                            "id": 1,
                                            "text": "False"
                                        }
                                    ],
                                    "correct_answer": 1,
                                    "tip": "the university can verify your disability after you have supplied diagnostic evidence."
                                },
                                {
                                    "index": 2,
                                    "text": "Evidence is only required for a medical condition. ",
                                    "answers": [
                                        {
                                            "id": 0,
                                            "text": "True"
                                        },
                                        {
                                            "id": 1,
                                            "text": "False"
                                        }
                                    ],
                                    "correct_answer": 1,
                                    "tip": "evidence is required for all disabilities including Specific Learning Disabilities (e.g. dyslexia, dyspraxia etc.) "
                                },
                                {
                                    "index": 3,
                                    "text": "It is your responsibility to verify your disability.",
                                    "answers": [
                                        {
                                            "id": 0,
                                            "text": "True"
                                        },
                                        {
                                            "id": 1,
                                            "text": "False"
                                        }
                                    ],
                                    "correct_answer": 1,
                                    "tip": "The Disability Team will verify your disability once they have received diagnostic evidence.  It is your responsibility to disclose and provide evidence in the first instance."
                                },
                                {
                                    "index": 4,
                                    "text": "The data protection form should be signed at the earliest point.",
                                    "answers": [
                                        {
                                            "id": 0,
                                            "text": "True"
                                        },
                                        {
                                            "id": 1,
                                            "text": "False"
                                        }
                                    ],
                                    "correct_answer": 0,
                                    "tip": ""
                                },
                                {
                                    "index": 5,
                                    "text": "Once your disability is verified by the disabilities Team, all adjustments etc. will be put in place.",
                                    "answers": [
                                        {
                                            "id": 0,
                                            "text": "True"
                                        },
                                        {
                                            "id": 1,
                                            "text": "False"
                                        }
                                    ],
                                    "correct_answer": 1,
                                    "tip": "It is useful and important for you to speak directly to your faculty and ensure they are aware of; your disability, reasonable adjustments requested and other needs (e.g. IEA)."
                                },
                                {
                                    "index": 6,
                                    "text": "If details of your disability are added and saved on the University’s database all arrangements/ adjustments will be organised. ",
                                    "answers": [
                                        {
                                            "id": 0,
                                            "text": "True"
                                        },
                                        {
                                            "id": 1,
                                            "text": "False"
                                        }
                                    ],
                                    "correct_answer": 1,
                                    "tip": "Whilst having the details added to the database is necessary it is not a guarantee that everything will run smoothly. It is useful for you to regularly communicate with your faculty to ensure they are aware of; your disability, reasonable adjustments requested and other needs (e.g. IEA and placement requests)."
                                },
                                {
                                    "index": 7,
                                    "text": "The disabilities Team will support you with disclosing a disability and completing required documents.",
                                    "answers": [
                                        {
                                            "id": 0,
                                            "text": "True"
                                        },
                                        {
                                            "id": 1,
                                            "text": "False"
                                        }
                                    ],
                                    "correct_answer": 0,
                                    "tip": "you can make an appointment with a disability advisor using connect2 following the link: https://healthandwellbeingbookings.coventry.ac.uk/"
                                }
                            ],
                            "space_after": false
                        }
                    ],
                    "space_after": true
                }
            ]
        },
        {
            "blockname": "Disclosure",
            "name": "Reflection",
            "sections": [
                {
                    "subtitle": "Reflect",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "If a student chooses not to disclose a disability, could their actions influence their duty of care to patients or clients?"
                        },
                        {
                            "type": "text-paragraph",
                            "text": "If a student has a hidden disability, how will practitioners or educators/mentors know they may need extra support?"
                        },
                        {
                            "type": "text-paragraph",
                            "text": "What is the role of the Learning Support Tutor?"
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Disclosure",
            "name": "Flowchart",
            "sections": [
                {
                    "subtitle": "Flowchart",
                    "components": [
                        {
                            "type": "link-website",
                            "links": [
                                {
                                    "link": "https://cele.coventry.ac.uk/projects/reasonableadjustments/Support_Process/Support_Process.html",
                                    "text": "Support Process"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Disclosure",
            "name": "Summary",
            "sections": [
                {
                    "subtitle": "Summary",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "Once a student declares a disability and provides appropriate evidence, the University has a duty of care to support the student and offer reasonable adjustments. A student could decide to not disclose a disability."
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Disclosure",
            "name": "References",
            "sections": [
                {
                    "subtitle": "References",
                    "components": [
                        {
                            "type": "link-website",
                            "links": [
                                {
                                    "text": "Disability UK Website",
                                    "link": "https://www.disabilityrightsuk.org/how-we-can-help/benefits-information/factsheets/education-factsheets"
                                },
                                {
                                    "text": "Disability Student Allowance Website",
                                    "link": "https://dsa-qag.org.uk/"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}