{
    "block": "Students",
    "name": "Coping on Placement",
    "chapters": [
        {
            "blockname": "Coping on Placement",
            "name": "Introduction",
            "sections": [
                {
                    "subtitle": "Introduction",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "Every student will benefit from considering the coping strategies they could use on placement. You may feel a little drained, physically or emotionally worn down and/or find working with certain people difficult. The work place is challenging and you may encounter people or situations that knock your confidence or demand a lot from your emotional reservoir.",
                            "space_after": false
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "Learning Outcomes",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "This section will highlight some key tips for coping on placement and suggestions for planning towards a successful placement.",
                            "space_after": false
                        }
                    ],
                    "space_after": true
                }
            ]
        },
        {
            "blockname": "Coping on Placement",
            "name": "Success on Placement",
            "sections": [
                {
                    "subtitle": "Introduction",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "As a student you are ultimately responsible for your learning. You will have a lot of support from your tutors at University who have prepared you theoretically for practicing skills, values and attitudes during the placement. Educators and mentors will be supporting you during the placement by providing learning opportunities and giving you feedback. The educators and mentors will also be your assessors and therefore will be responsible for ensuring that you can demonstrate the competencies and practice safely.",
                            "space_after": true
                        },
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "As a student it is important you understand the outcomes for each placement, ensure you understand what you need to demonstrate and take any opportunities for learning seriously. Do what you can to learn and show your educator or mentor that you are meeting the required competencies.",
                            "space_after": false
                        },
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "You will be able to discuss any concerns with your educator or mentor. ",
                            "space_after": false
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "Getting the most of your Clinical Placement",
                    "components": [
                        {
                            "subtitle": "Key Points to follow in order to get the most out of your placement"
                        },
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "1.   There are usually a lot of students on placement at any given time. Students are on placement often during the training period.",
                            "space_after": true
                        },
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "2.   Educators are trained, registered and supported. Mentors must be a registered nurse with at least 12 months’ experience and a mentoring qualification",
                            "space_after": true
                        },
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "3.   Although students are expected to participate in direct patient care, they remain supernumerary",
                            "space_after": true
                        },
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "4.   Students should be encouraged to reflect as this helps to link theory learnt in university to experiences gained in practice",
                            "space_after": true
                        },
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "5.   Students have a responsibility to report behaviour that puts others at risk",
                            "space_after": true
                        },
                        {
                            "subtitle": "Follow this link for more information",
                            "type": "link-website",
                            "links": [
                                {
                                    "tag": "",
                                    "text": "Getting the most out of your placement",
                                    "link": "https://www.nursingtimes.net/getting-the-most-out-of-your-clinical-placement/5063190.article"
                                }
                            ],
                            "space_after": false
                        }
                    ],
                    "space_after": false
                },
                {
                    "subtitle": "Success on Placement (Documents)",
                    "components": [
                        {
                            "type": "link-pdf",
                            "links": [
                                {
                                    "link": "pdfs/Get Back to where we belong Guide for disabled people in employment.pdf",
                                    "text": "Get Back to where we belong Guide for disabled people in employment"
                                },
                                {
                                    "link": "pdfs/HelpingStudentsgettheBestfromtheirPracticePlacements.pdf",
                                    "text": "Helping students get the best from their practice placements."
                                },
                                {
                                    "link": "pdfs/Resilience booklet going wth the flow for TFL employees.pdf",
                                    "text": "Resilience booklet going wth the flow for TFL employees"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Coping on Placement",
            "name": "Proactive Support",
            "sections": [
                {
                    "subtitle": "The right mentality",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "The best thing you could take on placement is a positive attitude. Educators and mentors are always happy to welcome students and support their learning. They find this easier when students come to the placement with an attitude that is positive. This simply means a student is willing to learn and will be confident to ask for help when they are confronted by activities that are outside their scope of practice. The clinical placement is not a natural pedagogical atmosphere, however, the educators and mentors have been in your shoes and are quite welcoming and inspiring. You are quite likely to find new graduates on your ward who were on placement just a few months ago too; they will be happy to support your learning and help you.",
                            "space_after": false
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-quote",
                            "text": "Student nurses value a welcoming workplace where staff and educators are happy to help and have a positive attitude to student presence on the wards",
                            "author": "Doyle et al ",
                            "year": "2017"
                        }
                    ],
                    "space_after": false
                },
                {
                    "subtitle": "Case Study",
                    "components": [
                        {
                            "type": "link-pdf",
                            "straightlink": {
                                "link": ""
                            },
                            "links": [
                                {
                                    "link": "pdfs/casestudy_selfawareness.docx",
                                    "text": "Self-Awareness (Case Study)"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Coping on Placement",
            "name": "Wellbeing Promotion",
            "sections": [
                {
                    "subtitle": "What is Wellbeing?",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "Your health is very important. Wellbeing involves taking care of emotional and mental wellbeing as well as physical wellbeing. ",
                            "space_after": true
                        },
                        {
                            "type": "text-alert",
                            "text": "If you are feeling unwell, physically or mentally, you should always seek the opinion of a doctor."
                        }
                    ],
                    "space_after": false
                },
                {
                    "subtitle": "Physical Wellbeing",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "Physical health is connected to mental and emotional health. Taking care of your body is an effective first step towards mental and emotional health. The mind and the body are linked and health benefits of becoming more physically active are significant. Physical activity involves anything we do that involves moving our bodies including exercise and sport.",
                            "space_after": true
                        },
                        {
                            "subtitle": "How can I increase my physical activity?",
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Set specific, realistic and attainable goals"
                                },
                                {
                                    "text": "Take the stairs instead of the lift/ elevator"
                                },
                                {
                                    "text": "Visit Coventry University’s sport centre and take a class or visit the gym"
                                },
                                {
                                    "text": "Add short walks in between lectures/ study sessions"
                                },
                                {
                                    "text": "Become involved in a sport "
                                },
                                {
                                    "text": "Start using a pedometer to track your walking"
                                }
                            ],
                            "space_after": false
                        },
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "When you improve your physical health, you'll experience greater mental and emotional well-being",
                            "space_after": false
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "Diet and Exercise",
                    "components": [
                        {
                            "subtitle": "The key to a healthy diet is to:",
                            "type": "text-paragraph",
                            "list_elements": [],
                            "text": "Eat the right amount of calories for how active you are, so that you balance the energy you consume with the energy you use. If you eat or drink too much, you'll put on weight. If you eat and drink too little, you'll lose weight.\n\nEat a wide range of foods to ensure that you're getting a balanced diet and that your body is receiving all the nutrients it needs."
                        },
                        {
                            "subtitle": "These eight practical tips cover the basics of healthy eating, and can help you make healthier choices",
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Base your meals on starchy carbohydrates"
                                },
                                {
                                    "text": "Eat lots of fruits and vegetables."
                                },
                                {
                                    "text": "Eat more fish - including a portion of oily fish - or onclude vegetarian sources of omega 3."
                                },
                                {
                                    "text": "Cut down on saturated fat and sugar."
                                },
                                {
                                    "text": "Eat less salt - no more than 6g a day for adults."
                                },
                                {
                                    "text": "Get active and have a healthy weight."
                                },
                                {
                                    "text": "Don't get thirsty."
                                },
                                {
                                    "text": "Don't skip breakfast."
                                }
                            ]
                        },
                        {
                            "type": "link-website",
                            "links": [
                                {
                                    "link": "https://www.nhs.uk/Livewell/Goodfood/Pages/eight-tips-healthy-eating.aspx",
                                    "text": "NHS - Eight tips to staying healthy",
                                    "tag": "SOURCE"
                                }
                            ]
                        }
                    ]
                },
                {
                    "subtitle": "Emotional and mental well-being ",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "Mental wellbeing describes your mental state - how you are feeling and how well you can cope with day-to-day life. ",
                            "space_after": true
                        },
                        {
                            "subtitle": "Five steps to mental wellbeing are:",
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Connect and communicate face to face with people – there is strong evidence that suggests that feeling close to and valued by other people is a fundamental human need. "
                                },
                                {
                                    "text": "Be active – regular physical activity is linked to lower rates of depression and anxiety"
                                },
                                {
                                    "text": "Take notice – reminding yourself to take notice can strengthen and broaden awareness. Take time to enjoy the environment around you. "
                                },
                                {
                                    "text": "Learn – continuing to learn throughout life builds good self-esteem and encourages social interaction. "
                                },
                                {
                                    "text": "Give – individuals who report a greater interest in helping others are more likely to rate themselves as feeling happy.  "
                                }
                            ],
                            "space_after": false
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "More information",
                    "components": [
                        {
                            "subtitle": "Counselling Services",
                            "type": "link-website",
                            "links": [
                                {
                                    "link": "http://www.coventry.ac.uk/study-at-coventry/student-support/health-and-wellbeing/counselling-and-mental-health-service/",
                                    "text": "Coventry University counselling service"
                                },
                                {
                                    "link": "https://www.england.nhs.uk/mental-health/adults/iapt/",
                                    "text": "NHS - Adult Improving Access to Psychological Therapies programme (IAPT)"
                                },
                                {
                                    "link": "http://cwfriend.co.uk/",
                                    "text": "Coventry Friend: Counselling (LGBT)"
                                },
                                {
                                    "link": "https://www.counselling-directory.org.uk/",
                                    "text": "Counselling Directory - find a counsellor near you"
                                },
                                {
                                    "link": "https://www.cwmind.org.uk/get-help",
                                    "text": "Coventry and Warwickshire Mind"
                                }
                            ]
                        },
                        {
                            "subtitle": "",
                            "type": "link-website",
                            "links": [
                                {
                                    "tag": "",
                                    "text": "Five ways to wellbeing",
                                    "link": "https://www.mind.org.uk/workplace/mental-health-at-work/taking-care-of-yourself/five-ways-to-wellbeing/ "
                                }
                            ],
                            "space_after": false
                        }
                    ],
                    "space_after": false
                }
            ]
        },
        {
            "blockname": "Coping on Placement",
            "name": "Strategies",
            "sections": [
                {
                    "subtitle": "What to do if you feel isolated",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "Some students report feelings of isolation on their placement. This may be because they are away from their friends and home. Don’t worry- there are lots of strategies you can use to reduce these feelings."
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Friends"
                                },
                                {
                                    "text": "The Disabilities Team"
                                },
                                {
                                    "text": "Family"
                                },
                                {
                                    "text": "Your mentor or practice educator"
                                }
                            ],
                            "subtitle": "Talk to someone",
                            "space_after": false
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Enquire about other students on placement near you"
                                },
                                {
                                    "text": "Get involved in activities organised by your placement"
                                },
                                {
                                    "text": "Keep in touch using social media"
                                },
                                {
                                    "text": "Plan activities for your days off"
                                }
                            ]
                        },
                        {
                            "subtitle": "",
                            "space_after": true,
                            "type": "text-paragraph",
                            "text": "If these feelings persist you may need to book an appointment to visit your GP.",
                            "embolden": true
                        },
                        {
                            "type": "text-paragraph",
                            "subtitle": "Working in a professional work environment",
                            "text": "Research the Trust, school or organisation you will be working in. You can learn about the ethos and culture by looking on the internet. You will benefit from learning as much as you can about the local policies, the community of professionals and the work practice. You could ask your educator/mentor questions about policies you do not understand during your induction.",
                            "space_after": true
                        },
                        {
                            "type": "text-paragraph",
                            "text": "Before you start a placement reflect on what your strengths are and how you could use this to your advantage during placement. You may be good communicator or great at organising and managing your time. These are great skills. You could also think about the things you may struggle with and what you can do to.",
                            "subtitle": "What are your challenges?",
                            "space_after": true
                        }
                    ]
                },
                {
                    "subtitle": "Apps and resources to help with coping on placement",
                    "components": [
                        {
                            "subtitle": "Coventry University time management system",
                            "type": "link-website",
                            "links": [
                                {
                                    "link": "https://sway.com/PmxH3yiPqlEtJ1tb?ref=Link",
                                    "text": "Time Management (Sway)"
                                }
                            ]
                        },
                        {
                            "type": "link-pdf",
                            "links": [
                                {
                                    "link": "pdfs/personaltoolkit.docx",
                                    "text": "Personal Toolkit (Download)"
                                }
                            ],
                            "subtitle": "Personal toolkit for organising your time"
                        },
                        {
                            "subtitle": "Online Apps",
                            "type": "link-website",
                            "links": [
                                {
                                    "link": "https://99designs.co.uk/blog/tips-en-gb/10-organization-apps-will-keep-efficient-2015/",
                                    "text": "Best 10 apps for organising your time"
                                },
                                {
                                    "link": "https://www.pastemagazine.com/articles/2016/09/organizing-ones-life-is-rarely.html",
                                    "text": "Tips on organising your time and useful apps (Paste Magazine)"
                                }
                            ]
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "Advice from students about placements",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "video-carousel",
                            "videos": [
                                {
                                    "type": "video-single",
                                    "subtitle": "Student nurses give their advice about placement",
                                    "video": {
                                        "type": "youtube",
                                        "thumb": "1gsjp9SNrGc.jpg",
                                        "src": "https://www.youtube.com/embed/1gsjp9SNrGc"
                                    }
                                },
                                {
                                    "type": "video-single",
                                    "subtitle": "The placement experience- Mental Health",
                                    "video": {
                                        "type": "youtube",
                                        "thumb": "4MFHNRnS2Fw.jpg",
                                        "src": "https://www.youtube.com/embed/4MFHNRnS2Fw"
                                    }
                                },
                                {
                                    "type": "video-single",
                                    "subtitle": "Clinical Placements Reflections",
                                    "video": {
                                        "type": "youtube",
                                        "thumb": "d69X1mGIG1c.jpg",
                                        "src": "https://www.youtube.com/embed/d69X1mGIG1c"
                                    }
                                }
                            ]
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "Consider patient safety and competencies",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "The patient is at the centre of healthcare delivery. Everything that happens in a clinical or work environment centres on supporting patient care. Students on placement are expected to ensure they are fit to participate in this duty and are not at risk to patients in anyway."
                        },
                        {
                            "type": "video-single",
                            "subtitle": "Nursing students talk about their experiences",
                            "video": {
                                "type": "youtube",
                                "src": "https://www.youtube.com/embed/T8BrZ242dfY",
                                "thumb": "T8BrZ242dfY.jpg"
                            },
                            "space_after": true
                        },
                        {
                            "subtitle": "Be flexible",
                            "type": "text-paragraph",
                            "text": "The clinical environment is unlike any other workplace. Be prepared to be flexible. No two days would be the same. It is an exciting opportunity to experience and learn all you can about your profession and see first-hand how you would be expected to behave and practice when you qualify."
                        },
                        {
                            "type": "text-paragraph",
                            "text": "Be prepared to enjoy the ride, unexpected things may happen, you will be thinking on your feet and responding to some very challenging situations. You have all the support you will need and you are not expected to act a registered member of staff, so you have the opportunity to ask a lot of questions and reflect on your experiences. Perhaps it may be useful to keep a reflective diary."
                        }
                    ]
                },
                {
                    "subtitle": "Top tips",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "The Student Executive Committee (Chartered Physiotherapy Society) have a few tips to help you get the most from the experience."
                        },
                        {
                            "type": "link-website",
                            "links": [
                                {
                                    "link": "http://www.csp.org.uk/membership/student-members/top-tips-clinical-placement-success",
                                    "text": "Top tips for clinical placements"
                                }
                            ]
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "What to expect – Placements are work environments, primarily geared towards caring for patients or clients. It is an opportunity to learn skills and good practice."
                                },
                                {
                                    "text": "Your responsibilities and Professional etiquette and personal conduct  – See guidelines from HCPC and NMC"
                                },
                                {
                                    "text": "Your host’s responsibilities – the placement providers are expected to support your learning and assess your skills. They have a duty of care towards you as an employee while you are on placement."
                                },
                                {
                                    "text": "Shared responsibilities – you have a responsibility to learn and act as supernumerary staff. This is an opportunity to join a team and practice some skills. The more you practice, the more your confidence will grow. Always speak to your educator or mentor about the goals you want to achieve and ask them to supervise you."
                                },
                                {
                                    "text": "Communication is key – Talk to your educator or mentor. They can only know what you need if you tell them."
                                },
                                {
                                    "text": "Networking at work – seek out other students. Many units have study days, during this time you will be able to meet other students who you can talk and learn with."
                                },
                                {
                                    "text": "How can you network at work? – be open. \nIntroduce yourself to the staff and team and offer your assistance. This may sound daunting, but it is a good way to interact. You may be called on to do interesting tasks.\nLook out for any social/sports events and sign up. It’s a great way to meet other people in the company. \nBe open, make eye contact with others, smile at people when you can in the hallway, lift or in the kitchen and say hello. This is actually important - be interested! Make sure you ask open-ended questions"
                                },
                                {
                                    "text": "When you finish your placement - reflect on your progress."
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Coping on Placement",
            "name": "Summary",
            "sections": [
                {
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "The section provides information that inform you about the placement environment, things you should consider and strategies for coping on placement."
                        }
                    ],
                    "subtitle": "Summary"
                }
            ]
        },
        {
            "blockname": "Coping on Placement",
            "name": "References",
            "sections": [
                {
                    "subtitle": "References",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "link-reference",
                            "space_after": false,
                            "title": "Happy to help/happy to be here: Identifying components of successful clinical placements for undergraduate nursing students.",
                            "authors": [
                                {
                                    "name": "Doyle, K."
                                },
                                {
                                    "name": "Sainsbury, K."
                                },
                                {
                                    "name": "Cleary, S."
                                },
                                {
                                    "name": "Parkinson, L."
                                },
                                {
                                    "name": "Vindigni, D"
                                },
                                {
                                    "name": "McGrath, I and Cruickshank, M."
                                }
                            ],
                            "year": "2017",
                            "publisher": "Nurse Education Today",
                            "volume": "49",
                            "pages": "27-32",
                            "link": "http://www.nurseeducationtoday.com/article/S0260-6917(16)30255-6/pdf"
                        },
                        {
                            "subtitle": "",
                            "type": "link-reference",
                            "space_after": false,
                            "title": "Getting the most out of your clinical placement. ",
                            "authors": [
                                {
                                    "name": "Whitehead, B"
                                }
                            ],
                            "year": "2013",
                            "publisher": "Nursing Times",
                            "volume": "109:37",
                            "pages": "12-13",
                            "link": "https://www.nursingtimes.net/journals/2013/09/13/l/s/s/180913-getting-the-most-out-of-your-clinical-placement.pdf"
                        }
                    ]
                }
            ]
        }
    ]
}