{
    "block": "Students",
    "name": "Evaluating the Placement",
    "chapters": [
        {
            "blockname": "Evaluating the Placement",
            "name": "Introduction",
            "sections": [
                {
                    "subtitle": "Congratulations",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "Hooray the placement is over. Well done."
                        }
                    ]
                },
                {
                    "components": [
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "To support students evaluate a placement as it comes to an end."
                                },
                                {
                                    "text": "To support students develop the practice of reflecting on their practice and preparing for the next placement."
                                },
                                {
                                    "text": "To encourage students to think about the impact of the placement experience on their practice; as well as on social and emotional life."
                                },
                                {
                                    "text": "Students can design different models for reflecting on their experience."
                                }
                            ]
                        }
                    ],
                    "subtitle": "Learning Outcomes"
                }
            ]
        },
        {
            "blockname": "Evaluating the Placement",
            "name": "Complete placement evaluation",
            "sections": [
                {
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "The Faculty has an evaluation form which informs how placements are planned and regulated. Please complete this form at the earliest opportunity."
                        },
                        {
                            "type": "text-paragraph",
                            "text": "In addition:\nReturn any equipment and other resources you may have being loaned from the placement site\nEnsure all PPE and uniforms are clean and safely stored for the next placement."
                        }
                    ],
                    "subtitle": "Finalization",
                    "space_after": true
                },
                {
                    "subtitle": "Was placement successful?",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "You may have had a discussion with your educator and visiting tutor or other University staff about how successful the placement experience was. You could also think about going through your notes, diaries or reflection. Articulate your thoughts and learning. This will be useful as you prepare for next placement."
                        },
                        {
                            "subtitle": "Did Reasonable Adjustments work well for you?",
                            "type": "text-paragraph",
                            "text": "Did you have reasonable adjustments, were they suitable? Think about how you could use them on the next placement."
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Evaluating the Placement",
            "name": "Reflection",
            "sections": [
                {
                    "subtitle": "Reflection",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "It is good practice for students to reflect on their practice and how the placement went. Some lecturers will encourage students to write a reflective piece about their placement. The University’s Employability Support Team has guidelines."
                        },
                        {
                            "type": "text-paragraph",
                            "text": "What follows will be extracts from the linked document below, giving you guidelines on what reflective writing is and how to write it. If you want to read the entire document, download the document from the link below. The extracts represent the parts that are relevant to reflective writing, but the document contains other relevant information as well."
                        },
                        {
                            "type": "link-pdf",
                            "links": [
                                {
                                    "link": "pdfs/Guidelines for Academics Supervising Sandwich Placement Students_Sept 2017.docx",
                                    "text": "Guidelines for Academics Supervising Sandwich Placement (Pages 18-21)"
                                }
                            ]
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "Extracts on reflective writing",
                    "components": [
                        {
                            "subtitle": "Appendix Two",
                            "type": "text-paragraph"
                        },
                        {
                            "subtitle": "Reflective Writing",
                            "type": "text-paragraph"
                        }
                    ]
                },
                {
                    "subtitle": "What is reflection?",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "Reflection is an everyday process. We all reflect on a range of everyday problems and situations all the time: What went well? What didn’t? Why?\nHow do I feel about it?"
                        },
                        {
                            "type": "text-paragraph",
                            "text": "We don’t usually follow a formula for this - it just happens as feelings, thoughts and emotions about something gradually ‘surface’. We might choose to do something differently, or not, as a result of reflecting, but reflection is essentially a kind of loose processing of thoughts and feelings about an incident, a meeting, a day – any event or experience at all."
                        },
                        {
                            "type": "text-paragraph",
                            "text": "Reflection can be a more structured way of processing in order to deal with a problem. This type of reflection may take place when we have had time to stand back from something, or talk it through, as in: ‘On reflection, I think you might be right’, or ‘On second thoughts, I realised he was more upset than me.’"
                        },
                        {
                            "type": "text-paragraph",
                            "text": "This might take a more structured form, if we consciously reflect (e.g. a teacher reflecting on a lesson). In this kind of reflection, the aim is to think carefully about what happened, sort out what is really going on and explore in depth, with a view to change or improvement in the future."
                        }
                    ]
                },
                {
                    "subtitle": "The Nature and Content of Reflection",
                    "components": [
                        {
                            "type": "text-quote",
                            "text": "‘… a form of mental processing with a purpose and/or anticipated outcome that is applied to relatively complex or unstructured ideas for which there is not an obvious solution'",
                            "author": "Moon",
                            "year": "1999:23"
                        },
                        {
                            "type": "text-paragraph",
                            "text": "She continues by outlining some of the purposes for reflection:"
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "To consider the process of our own learning – a process of metacognition"
                                },
                                {
                                    "text": "To critically review something - our own behaviour, that of others or the product of behaviour (e.g. an essay, book, painting etc.)"
                                },
                                {
                                    "text": "To build theory from observations: we draw theory from generalisations - sometimes impractical situations, sometimes in thoughts or a mixture of the two"
                                },
                                {
                                    "text": "To engage in personal or self-development"
                                },
                                {
                                    "text": "To make decisions or resolve uncertainty"
                                }
                            ]
                        }
                    ]
                },
                {
                    "subtitle": "The Key Elements of Reflection",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "Reflection is a type of thinking associated with deep thought, aimed at achieving better understanding. It contains a mixture of elements:"
                        },
                        {
                            "type": "list-text",
                            "subtitle": "Making sense of experience",
                            "list_elements": [
                                {
                                    "text": "We don’t always learn from experiences. Reflection is where we analyse experience, actively attempting to ‘make sense’ or find the meaning in it."
                                }
                            ]
                        },
                        {
                            "type": "list-text",
                            "subtitle": "Standing back",
                            "list_elements": [
                                {
                                    "text": "It can be hard to reflect when we are caught up in an activity. ‘Standing back’ gives a better view or perspective on an experience, issue or action."
                                }
                            ]
                        },
                        {
                            "type": "list-text",
                            "subtitle": "Repetition",
                            "list_elements": [
                                {
                                    "text": "Reflection involves ‘going over’ something, often several times, in order to get a broad view and check nothing is missed"
                                }
                            ]
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Reflection is associated with ‘striving after truth’. Through reflection, we can acknowledge things that we find difficult to admit in the normal course of events."
                                }
                            ],
                            "subtitle": "Deeper honesty"
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Reflection involves being even-handed, or balanced in judgement. This means taking everything into account, not just the most obvious."
                                }
                            ],
                            "subtitle": "Weighing up"
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Reflection can bring greater clarity, like seeing events reflected in a mirror. This can help at any stage of planning, carrying out and reviewing activities."
                                }
                            ],
                            "subtitle": "Clarity"
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Reflection is about learning and understanding on a deeper level. This includes gaining valuable insights that cannot be just ‘taught’."
                                }
                            ],
                            "subtitle": "Understanding"
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Reflection involves an element of drawing conclusions in order to move on, change or develop an approach, strategy or activity."
                                }
                            ],
                            "subtitle": "Making judgements"
                        }
                    ]
                },
                {
                    "subtitle": "What is reflective writing?",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "Reflective writing is evidence of reflective thinking. In an academic context, reflective thinking usually involves:"
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Looking back at something (often an event, i.e. something that happened, but it could also be an idea or object)."
                                },
                                {
                                    "text": "Analysing the event or idea (thinking in depth and from different perspectives, and trying to explain, often with reference to a model or theory from your subject)."
                                },
                                {
                                    "text": "Thinking carefully about what the event or idea means for you and your on-going progress as a learner and/or practising professional."
                                }
                            ]
                        },
                        {
                            "type": "text-paragraph",
                            "text": "Reflective writing is thus more personal than other kinds of academic writing. We all think reflectively in everyday life, of course, but perhaps not to the same depth as that expected in good reflective writing at university level."
                        },
                        {
                            "type": "text-quote",
                            "subtitle": "Example of reflective writing",
                            "text": "Specific tasks were shared out amongst members of my team. Initially, however, the tasks were not seen as equally difficult by all team members. Cooperation between group members was at risk because of this perception of unfairness. Social interdependence theory recognises a type of group interaction called ‘positive interdependence’, meaning cooperation (Johnson &\nJohnson, 1993, cited by Maughan & Webb, 2001), and many studies have demonstrated that “cooperative learning experiences encourage higher achievement” (Maughan & Webb, 2001).  Ultimately, our group achieved a successful outcome, but to improve the process, we perhaps needed a chairperson to help encourage cooperation when tasks were being shared out. In future group work, on the course and at work, I would probably suggest this."
                        },
                        {
                            "type": "link-website",
                            "subtitle": "Reference",
                            "links": [
                                {
                                    "link": "http://193.62.18.232/library/archives/ukcle/78.158.56.101/archive/law/resources/teaching-and-learning-practices/grouplearning/index.html",
                                    "text": "Maughan, C., & Webb, J. (2001). Small group learning and assessment.  Retrieved 01/10/11 from the Higher Education Academy website"
                                }
                            ]
                        }
                    ]
                },
                {
                    "subtitle": "What is involved? The process of reflective writing",
                    "components": [
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "Description – what happened?"
                                },
                                {
                                    "text": "Interpretation – What is most important/relevant/useful about the event? How can it be explained (through reference to a theoretical framework)?"
                                },
                                {
                                    "text": "Outcome – What have I learned from this? What does this mean for my future?"
                                }
                            ],
                            "subtitle": "Description – Interpretation-Outcome",
                            "space_after": true
                        },
                        {
                            "type": "list-text",
                            "subtitle": "Or similarly:",
                            "list_elements": [
                                {
                                    "text": "Description – what happened?"
                                },
                                {
                                    "text": "Feelings and Analysis – how did it go? Why? How did you feel about it? What was behind your feelings and actions?"
                                },
                                {
                                    "text": "Theory – What was really going on? What needs to be looked at again, done differently next time?"
                                },
                                {
                                    "text": "Action – What should be done next time? How?"
                                }
                            ]
                        },
                        {
                            "type": "text-paragraph",
                            "text": "Reflection is an exploration and an explanation of events – not just a description of them."
                        }
                    ]
                },
                {
                    "subtitle": "Models of reflection/reflective practice",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "There is a vast literature on ‘reflective practice’.  A number of explanatory frameworks have been devise, in order to depict and explain the cognitive and affective processed involved. One of the most widely used is that of Gibbs (1988)."
                        },
                        {
                            "type": "image-single",
                            "src": "images/gibbscycle.jpg"
                        },
                        {
                            "subtitle": "Questions to consider at each step of the Gibbs cycle",
                            "type": "text-paragraph"
                        },
                        {
                            "type": "video-single",
                            "subtitle": "Reviewing Gibbs Cycle",
                            "video": {
                                "type": "youtube",
                                "src": "https://www.youtube.com/embed/Lua3JCCI3Zc",
                                "thumb": "Lua3JCCI3Zc.jpg"
                            }
                        },
                        {
                            "type": "list-text",
                            "subtitle": "Description",
                            "list_elements": [
                                {
                                    "text": "What happened? Give a concise, factual account.  Provide relevant details."
                                }
                            ],
                            "space_after": true
                        },
                        {
                            "subtitle": "Feelings",
                            "type": "text-paragraph",
                            "text": "Identify and examine reactions, feelings and thoughts at the time.\nIt is important, although often difficult, to be honest about these.",
                            "space_after": false
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "How can you explain your feelings? What was affecting them? Did they change? Why?"
                                },
                                {
                                    "text": "How did they affect your actions and thoughts at the time?"
                                },
                                {
                                    "text": "Looking back, have your views on this changed?"
                                }
                            ],
                            "space_after": true
                        },
                        {
                            "subtitle": "Evaluation",
                            "type": "text-paragraph",
                            "text": "Look at the judgements you made at the time about how things were going."
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "What was positive? Negative? What made you think this?"
                                },
                                {
                                    "text": "Try to stand back from the experience to gain a sense of how it went."
                                },
                                {
                                    "text": "What made you think something was good or bad?"
                                },
                                {
                                    "text": "Examine your own judgements and what contributed to them. How do you feel about them now?"
                                }
                            ],
                            "space_after": true
                        },
                        {
                            "subtitle": "Analysis",
                            "type": "text-paragraph",
                            "text": "In this section of the reflection, you need to examine the experience in depth, and start to theorise about key aspects. Try to identify an overarching issue, or key aspect of the experience that affected it profoundly, which needs to be examined for the future. For example, an aspect of communication or time management might have played a central part in the outcome."
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "How was it flawed this time? In what way? Why? How should it work in this situation?"
                                },
                                {
                                    "text": "What ideas or theories are you aware of which look at this? Does theory about this aspect help you make more sense of what happened?"
                                },
                                {
                                    "text": "Could you use theory to improve this aspect in the future? In this section, you need to fully examine and make sense of factors affecting the situation, and exploring ways to change and develop these."
                                }
                            ],
                            "space_after": true
                        },
                        {
                            "subtitle": "Conclusion",
                            "type": "text-paragraph",
                            "text": "Sum up the key things learned through the reflective process, the main factors affecting the situation, and what needs to be improved. This section might include identifying specific skills that need developing. You might identify new knowledge or training which is needed.",
                            "space_after": true
                        },
                        {
                            "subtitle": "Action plan",
                            "type": "text-paragraph",
                            "text": "This should be a practical section:",
                            "space_after": false
                        },
                        {
                            "type": "list-text",
                            "list_elements": [
                                {
                                    "text": "What could you do differently next time and how could you prepare for this?"
                                },
                                {
                                    "text": "What areas need developing or planning? What resources do you need, and where would they be found?"
                                },
                                {
                                    "text": "What steps will be taken first?"
                                }
                            ]
                        }
                    ],
                    "space_after": true
                },
                {
                    "subtitle": "Resources and further reading",
                    "components": [
                        {
                            "subtitle": "",
                            "type": "text-paragraph",
                            "text": "A very useful and detailed discussion of each stage of the Gibbs model can be found in:"
                        },
                        {
                            "type": "link-reference",
                            "title": "Reflection and ePortfolios",
                            "authors": [
                                {
                                    "name": "Alison Goulbourne"
                                }
                            ],
                            "link": "http://archive.qmu.ac.uk/eportfolio/documents/reflectioneportfolios.pdf",
                            "publisher": "Queen Margaret University",
                            "pages": "1-4"
                        },
                        {
                            "type": "text-paragraph",
                            "text": "For additional reading about reflection:"
                        },
                        {
                            "type": "link-reference",
                            "link": "https://www.macmillanihe.com/resources/sample-chapters/9781137289254_sample.pdf",
                            "title": "The Study Skills Handbook",
                            "authors": [
                                {
                                    "name": "Cottrell, S"
                                }
                            ],
                            "year": "2003",
                            "publisher": "Palgrave Macmillan",
                            "volume": "4"
                        },
                        {
                            "type": "link-reference",
                            "link": "https://www.macmillanihe.com/page/detail/Skills-for-Success/?K=9781137426529",
                            "title": "Skills for Success",
                            "authors": [
                                {
                                    "name": "Cottrell, S"
                                }
                            ],
                            "year": "2003",
                            "publisher": "Palgrave Macmillan"
                        },
                        {
                            "type": "link-reference",
                            "link": "https://thoughtsmostlyaboutlearning.files.wordpress.com/2015/12/learning-by-doing-graham-gibbs.pdf",
                            "title": "Learning by Doing. A Guide to Teaching and Learning Methods.",
                            "authors": [
                                {
                                    "name": "Gibbs, G."
                                }
                            ],
                            "year": "1998",
                            "publisher": "FEU"
                        },
                        {
                            "type": "link-reference",
                            "link": "https://capitadiscovery.co.uk/newman-ac/items/171380?query=learning+journals+a+handbook+for+reflective+practice+and+professional+development&resultsUri=items%3Fquery%3Dlearning%2Bjournals%2Ba%2Bhandbook%2Bfor%2Breflective%2Bpractice%2Band%2Bprofessional%2Bdevelopment",
                            "title": "Learning Journals: A handbook for academics, students and professional development.",
                            "authors": [
                                {
                                    "name": "Moon, J"
                                }
                            ],
                            "year": "1999",
                            "publisher": "London: Kogan Page"
                        }
                    ]
                }
            ]
        },
        {
            "blockname": "Evaluating the Placement",
            "name": "Summary",
            "sections": [
                {
                    "subtitle": "Summary",
                    "components": [
                        {
                            "type": "text-paragraph",
                            "text": "Evaluating a placement is useful for many reasons. It helps you celebrate your success and reflect on the things that went well and any things that could have gone better. You can use this experience to prepare for your next placement. There are forms you could complete that enable the placement teams collate your experiences and used by the teams to improve placement training and processes."
                        }
                    ]
                }
            ]
        }
    ]
}